xmlsamples/DAS_Query/PROD-JP-GetDeliveryOptionTemplate-AIS-JP540.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:h2h-das-request>
         <device>
            <id>H2H</id>
            <type>ATM</type>
         </device>
         <channel>
            <type>H2H</type>
            <name>JSB</name>
            <version>9500</version>
         </channel>
         <foreign_remote_system>
            <identifier>WGHHJP5400P</identifier>
            <reference_no>20001287</reference_no>
            <counter_id>JP540PT001A</counter_id>
         </foreign_remote_system>
         <client_id>H2H</client_id>
         <name>GetDeliveryOptionTemplate</name>
         <filters>
            <queryfilter1>en</queryfilter1>
            <queryfilter2>CN CNY</queryfilter2>
            <queryfilter3>4040</queryfilter3>
         </filters>
      </xrsi:h2h-das-request>
   </soapenv:Body>
</soapenv:Envelope>